hubtec_tasks_api/app/controllers/api/v1/tasks_controller.rb

    def index
      render json: Task.find_user_tasks(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "tony@teste.com"], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

    def create
      @task = Task.new(task_params)
      @task.user_id = current_user.id
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "end_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "name"], ["description", "description"], ["end_time", "2020-04-04 00:00:00"], ["user_id", 1], ["created_at", "2019-06-19 14:07:42.810104"], ["updated_at", "2019-06-19 14:07:42.810104"]]

    def update
      if @task.update(task_params)
---
UPDATE "tasks" SET "name" = $1, "description" = $2, "end_time" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["name", "name_update"], ["description", "description_update"], ["end_time", "2021-04-04 00:00:00"], ["updated_at", "2019-06-19 23:10:57.321364"], ["id", 2]]

    def destroyed
      render json: Task.find_deleted_tasks(current_user.id)
---
SELECT "tasks".* FROM "tasks" WHERE (user_id = 1) AND "tasks"."deleted_at" IS NOT NULL

    def set_task
      @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_task_destroyed
      @task = Task.unscoped.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]