hubtec_tasks_api/app/controllers/api/v1/tasks_controller.rb

    def delete
      if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]